Autodesk.Revit.DB.ImportOptions3DM.#ctor(Autodesk.Revit.DB.ImportOptions3DM)
Constructs a new instance of ImportOptions3DM as a copy of the provided import options.
option:
The 3DM import options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ImportOptions3DM.#ctor
Constructs a new instance of ImportOptions3DM with default values of all properties.
Since:
2022

Autodesk.Revit.DB.ImportOptions3DM
The import options used to import 3DM format files.
Since:
2022